eventier/app/views/events/index.html.erb

        <p><strong><%= event.created_at %></strong></p>
        <p><%= link_to "#{event.event_comments.count} コメント", event_path(event.id) %></p>
---
SELECT "events".* FROM "events"
SELECT COUNT(*) FROM "events"
SELECT COUNT(*) FROM "event_comments" WHERE "event_comments"."event_id" = ?  [["event_id", 7]]