eventier/app/views/events/index.html.erb

          <%= link_to "#{event.event_comments.count} コメント", event_path(event.id) %>
          <%= link_to "★#{event.favorites.count}", event_path(event.id) %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."event_id" = ?  [["event_id", 7]]