eventier/app/views/events/search.html.erb

SELECT "events".* FROM "events" WHERE (name LIKE '%さくら%' OR prefecture LIKE '%さくら%' OR caption LIKE '%さくら%' OR age LIKE '%さくら%')
SELECT COUNT(*) FROM "event_comments" WHERE "event_comments"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."event_id" = ?  [["event_id", 1]]
---
        <p>
          <%= link_to "#{event.event_comments.count} コメント", event_path(event.id) %>
          <%= link_to "★#{event.favorites.count}", event_path(event.id) %>