eventier/app/views/events/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."event_id" = ?  [["event_id", 3]]
---
      <%= link_to event_favorites_path(@event), method: :delete do %>
        ★<%= @event.favorites.count %> いいね