eventier/app/views/events/show.html.erb

SELECT "event_comments".* FROM "event_comments" WHERE "event_comments"."event_id" = ?  [["event_id", 3]]
SELECT COUNT(*) FROM "event_comments" WHERE "event_comments"."event_id" = ?  [["event_id", 2]]
---
      <div class="col-3 offset-1 mt-2">
        <p>コメント件数 : <%= @event.event_comments.count %></p>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."event_id" = ?  [["event_id", 2]]
---
            <%= link_to event_favorites_path(@event), method: :delete do %>
              ★<%= @event.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."event_id" = ?  [["event_id", 3]]
---
            <%= link_to event_favorites_path(@event), method: :post do %>
              ☆<%= @event.favorites.count %> いいね

SELECT "event_comments".* FROM "event_comments" WHERE "event_comments"."event_id" = ?  [["event_id", 3]]
---
      <div class="col-5 offset-1">
        <% @event.event_comments.each do |event_comment| %>