eventier/app/views/users/index.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 2]]
---
              <td><%= user.name %></td>
              <td><%= user.events.count %>件</td>