eventier/app/views/relationships/followers.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
---
              <td><%= user.name %></td>
              <td><%= user.events.count %>件</td>