eventier/app/controllers/events_controller.rb

INSERT INTO "events" ("user_id", "name", "image_id", "caption", "created_at", "updated_at", "prefecture", "age") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id
    if @event.save

SELECT "events".* FROM "events" WHERE (name LIKE '%さくら%' OR prefecture LIKE '%さくら%' OR caption LIKE '%さくら%' OR age LIKE '%さくら%')
---
  def search
    @events = Event.search(params[:search])

SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"
---
  def index
    @events = Event.page(params[:page]).per(20).reverse_order

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "events" SET "image_id" = ?, "prefecture" = ?, "age" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["image_id", "226b5dcd52ceaf7639feaf60ee4a2bc757ad031eed8100cb306ee2ae5cbc"], ["prefecture", "石川県"], ["age", "４１～６０歳"], ["updated_at", "2021-10-17 05:19:11.198554"], ["id", 4]]
---
  def update
    @event = Event.find(params[:id])
    @event.update(event_params)