eventier/app/controllers/event_comments_controller.rb

  def create
    event = Event.find(params[:event_id])
    comment = current_user.event_comments.new(event_comment_params)
    comment.event_id = event.id
    comment.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "event_comments" ("comment", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "a"], ["user_id", 1], ["event_id", 3], ["created_at", "2021-10-13 15:43:07.285649"], ["updated_at", "2021-10-13 15:43:07.285649"]]

  def destroy
    EventComment.find_by(id: params[:id]).destroy
---
DELETE FROM "event_comments" WHERE "event_comments"."id" = ?  [["id", 1]]
SELECT  "event_comments".* FROM "event_comments" WHERE "event_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]