eventier/app/controllers/homes_controller.rb

SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
---
  def top
    @events = Event.page(params[:page]).per(8).reverse_order