eventier/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @users = User.page(params[:page]).per(20).reverse_order

SELECT "users".* FROM "users" WHERE (name LIKE '%自己紹介%' OR introduction LIKE '%自己紹介%')
---
  def search
    @users = User.search(params[:search])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."user_id" = ? ORDER BY "events"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 16], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @events = @user.events.page(params[:page]).per(16).reverse_order